[{"contributor": "ESPN", "relative_date": "2d", "full_date": "2025-02-06 18:12:58", "text": "Breaking: The New Orleans Pelicans have traded Brandon Ingram to the Toronto Raptors for Bruce Brown Jr., Kelly Olynyk, one first-round pick and one second-rounder, sources tell ESPN.", "url": "https://www.espn.com/contributor/espn/f336cd5518a82"}, {"contributor": "Shams Charania", "relative_date": "3d", "full_date": "2025-02-05 18:12:58", "text": "BREAKING: The Miami Heat are finalizing a deal to send Jimmy Butler to the Golden State Warriors for Andrew Wiggins, Dennis Schroder, Kyle Anderson and a protected first-round pick, sources tell ESPN.", "url": "https://www.espn.com/contributor/shams-charania/ad2fa0e8f8fab"}, {"contributor": "Shams Charania", "relative_date": "6d", "full_date": "2025-02-02 18:12:58", "text": "BREAKING: Sacramento is finalizing a trade to send De'Aaron Fox to the San Antonio Spurs in a multi-team trade that moves Chicago Bulls' Zach LaVine to the Kings, sources tell ESPN.", "url": "https://www.espn.com/contributor/shams-charania/90412c624880f"}, {"contributor": "Shams Charania", "relative_date": "6d", "full_date": "2025-02-02 18:12:58", "text": "James intends to stay with the Lakers beyond Thursday's trade deadline, a source confirmed to ESPN. James' plans were first reported Sunday by NBA reporter Chris Haynes.", "url": "https://www.espn.com/contributor/shams-charania/f1adfe6d85c0a"}, {"contributor": "Shams Charania", "relative_date": "7d", "full_date": "2025-02-01 18:12:59", "text": "The Los Angeles Clippers are trading PJ Tucker, Mo Bamba, a future second-round pick and cash to the Utah Jazz for Drew Eubanks and Patty Mills, sources tell me and Bobby Marks.", "url": "https://www.espn.com/contributor/shams-charania/89f98f612ef66"}, {"contributor": "Shams Charania", "relative_date": "8d", "full_date": "2025-01-31 18:12:59", "text": "BREAKING: The Dallas Mavericks are trading Luka Doncic, Maxi Kleber and Markieff Morris to the Los Angeles Lakers for Anthony Davis, Max Christie and a 2029 first-round pick, sources tell ESPN. Three-team deal that includes Utah.", "url": "https://www.espn.com/contributor/shams-charania/b3853705cb656"}, {"contributor": "Shams Charania", "relative_date": "8d", "full_date": "2025-01-31 18:12:59", "text": "New Orleans Pelicans guard Dejounte Murray has suffered a season-ending torn Achilles tendon, sources tell ESPN.", "url": "https://www.espn.com/contributor/shams-charania/4f2dcf6ce0cc3"}, {"contributor": "Shams Charania", "relative_date": "10d", "full_date": "2025-01-29 18:12:59", "text": "Charlotte Hornets star LaMelo Ball will be re-evaluated in one week with a left ankle sprain, sources tell ESPN. Ball, averaging 28.2 points and 7.3 assists this season, suffered the injury on Monday.", "url": "https://www.espn.com/contributor/shams-charania/839f10877c7c1"}, {"contributor": "Shams Charania", "relative_date": "11d", "full_date": "2025-01-28 18:12:59", "text": "After 11 seasons in Phoenix, 10-time WNBA All-Star Brittney Griner has agreed to a deal with the Atlanta Dream, sources tell ESPN. Griner spent her entire career with Mercury and now heads to Atlanta in one of most stunning free agency moves in league history.", "url": "https://www.espn.com/contributor/shams-charania/7415f0920d6a4"}, {"contributor": "Shams Charania", "relative_date": "11d", "full_date": "2025-01-28 18:12:59", "text": "JUST IN: The Sacramento Kings expected to open up talks to potentially deal All-Star De'Aaron Fox ahead of Feb. 6 trade deadline, sources tell ESPN. There will be plenty of suitors, but it's believed that Fox has a target destination in mind ahead of 2026 free agency.", "url": "https://www.espn.com/contributor/shams-charania/74242502de5e3"}]